<a href="https://colab.research.google.com/github/nhwhite212/DealingwithDataSpring2021/blob/colab/1-SQL/F-SQL_Queries_For_IMDB_and_Facebook_Databases.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

## SQL Queries

To be able to execute SQL queries from within a Jupyter notebook, we will use the `sql_magic` extension (https://github.com/pivotal/sql_magic)

    sudo pip3 install -U sql_magic

In [19]:
!sudo apt-get install -y python-dev libmysqlclient-dev && sudo pip install mysqlclient

Reading package lists... Done
Building dependency tree
Reading state information... Done
python-dev is already the newest version (2.7.15~rc1-1).
The following NEW packages will be installed:
  libmysqlclient-dev
0 upgraded, 1 newly installed, 0 to remove and 13 not upgraded.
Need to get 988 kB of archives.
After this operation, 6,013 kB of additional disk space will be used.
Get:1 http://archive.ubuntu.com/ubuntu bionic-updates/main amd64 libmysqlclient-dev amd64 5.7.32-0ubuntu0.18.04.1 [988 kB]
Fetched 988 kB in 0s (9,183 kB/s)
debconf: unable to initialize frontend: Dialog
debconf: (No usable dialog-like program is installed, so the dialog based frontend cannot be used. at /usr/share/perl5/Debconf/FrontEnd/Dialog.pm line 76, <> line 1.)
debconf: falling back to frontend: Readline
debconf: unable to initialize frontend: Readline
debconf: (This frontend requires a controlling tty.)
debconf: falling back to frontend: Teletype
dpkg-preconfigure: unable to re-open stdin:
Selecting previously unselected package libmysqlclient-dev.
(Reading database ... 146402 files and directories currently installed.)
Preparing to unpack .../libmysqlclient-dev_5.7.32-0ubuntu0.18.04.1_amd64.deb ...
Unpacking libmysqlclient-dev (5.7.32-0ubuntu0.18.04.1) ...
Setting up libmysqlclient-dev (5.7.32-0ubuntu0.18.04.1) ...
Processing triggers for man-db (2.8.3-2ubuntu0.1) ...
Collecting mysqlclient
  Using cached https://files.pythonhosted.org/packages/3c/df/59cd2fa5e48d0804d213bdcb1acb4d08c403b61c7ff7ed4dd4a6a2deb3f7/mysqlclient-2.0.3.tar.gz
Building wheels for collected packages: mysqlclient
  Building wheel for mysqlclient (setup.py) ... done
  Created wheel for mysqlclient: filename=mysqlclient-2.0.3-cp36-cp36m-linux_x86_64.whl size=99213 sha256=81a69c83d9f4f65687c1a97ac43833b0841408d1481d405c2057504a28f1301f
  Stored in directory: /root/.cache/pip/wheels/75/ca/e8/ad4e7ce3df18bcd91c7d84dd28c7c08db491a2a2360efed363
Successfully built mysqlclient
Installing collected packages: mysqlclient
Successfully installed mysqlclient-2.0.3

In [20]:
!pip3 install -U sql_magic

Requirement already up-to-date: sql_magic in /usr/local/lib/python3.6/dist-packages (0.0.4)
Requirement already satisfied, skipping upgrade: jupyter in /usr/local/lib/python3.6/dist-packages (from sql_magic) (1.0.0)
Requirement already satisfied, skipping upgrade: sqlparse in /usr/local/lib/python3.6/dist-packages (from sql_magic) (0.4.1)
Requirement already satisfied, skipping upgrade: ipython in /usr/local/lib/python3.6/dist-packages (from sql_magic) (5.5.0)
Requirement already satisfied, skipping upgrade: pandas in /usr/local/lib/python3.6/dist-packages (from sql_magic) (1.1.5)
Requirement already satisfied, skipping upgrade: findspark in /usr/local/lib/python3.6/dist-packages (from sql_magic) (1.4.2)
Requirement already satisfied, skipping upgrade: traitlets in /usr/local/lib/python3.6/dist-packages (from sql_magic) (4.3.3)
Requirement already satisfied, skipping upgrade: jupyter-console in /usr/local/lib/python3.6/dist-packages (from jupyter->sql_magic) (5.2.0)
Requirement already satisfied, skipping upgrade: ipywidgets in /usr/local/lib/python3.6/dist-packages (from jupyter->sql_magic) (7.6.3)
Requirement already satisfied, skipping upgrade: ipykernel in /usr/local/lib/python3.6/dist-packages (from jupyter->sql_magic) (4.10.1)
Requirement already satisfied, skipping upgrade: notebook in /usr/local/lib/python3.6/dist-packages (from jupyter->sql_magic) (5.3.1)
Requirement already satisfied, skipping upgrade: qtconsole in /usr/local/lib/python3.6/dist-packages (from jupyter->sql_magic) (5.0.2)
Requirement already satisfied, skipping upgrade: nbconvert in /usr/local/lib/python3.6/dist-packages (from jupyter->sql_magic) (5.6.1)
Requirement already satisfied, skipping upgrade: decorator in /usr/local/lib/python3.6/dist-packages (from ipython->sql_magic) (4.4.2)
Requirement already satisfied, skipping upgrade: pygments in /usr/local/lib/python3.6/dist-packages (from ipython->sql_magic) (2.6.1)
Requirement already satisfied, skipping upgrade: pickleshare in /usr/local/lib/python3.6/dist-packages (from ipython->sql_magic) (0.7.5)
Requirement already satisfied, skipping upgrade: simplegeneric>0.8 in /usr/local/lib/python3.6/dist-packages (from ipython->sql_magic) (0.8.1)
Requirement already satisfied, skipping upgrade: setuptools>=18.5 in /usr/local/lib/python3.6/dist-packages (from ipython->sql_magic) (51.3.3)
Requirement already satisfied, skipping upgrade: prompt-toolkit<2.0.0,>=1.0.4 in /usr/local/lib/python3.6/dist-packages (from ipython->sql_magic) (1.0.18)
Requirement already satisfied, skipping upgrade: pexpect; sys_platform != "win32" in /usr/local/lib/python3.6/dist-packages (from ipython->sql_magic) (4.8.0)
Requirement already satisfied, skipping upgrade: python-dateutil>=2.7.3 in /usr/local/lib/python3.6/dist-packages (from pandas->sql_magic) (2.8.1)
Requirement already satisfied, skipping upgrade: pytz>=2017.2 in /usr/local/lib/python3.6/dist-packages (from pandas->sql_magic) (2018.9)
Requirement already satisfied, skipping upgrade: numpy>=1.15.4 in /usr/local/lib/python3.6/dist-packages (from pandas->sql_magic) (1.19.5)
Requirement already satisfied, skipping upgrade: ipython-genutils in /usr/local/lib/python3.6/dist-packages (from traitlets->sql_magic) (0.2.0)
Requirement already satisfied, skipping upgrade: six in /usr/local/lib/python3.6/dist-packages (from traitlets->sql_magic) (1.15.0)
Requirement already satisfied, skipping upgrade: jupyter-client in /usr/local/lib/python3.6/dist-packages (from jupyter-console->jupyter->sql_magic) (5.3.5)
Requirement already satisfied, skipping upgrade: nbformat>=4.2.0 in /usr/local/lib/python3.6/dist-packages (from ipywidgets->jupyter->sql_magic) (5.1.2)
Requirement already satisfied, skipping upgrade: jupyterlab-widgets>=1.0.0; python_version >= "3.6" in /usr/local/lib/python3.6/dist-packages (from ipywidgets->jupyter->sql_magic) (1.0.0)
Requirement already satisfied, skipping upgrade: widgetsnbextension~=3.5.0 in /usr/local/lib/python3.6/dist-packages (from ipywidgets->jupyter->sql_magic) (3.5.1)
Requirement already satisfied, skipping upgrade: tornado>=4.0 in /usr/local/lib/python3.6/dist-packages (from ipykernel->jupyter->sql_magic) (5.1.1)
Requirement already satisfied, skipping upgrade: jupyter-core>=4.4.0 in /usr/local/lib/python3.6/dist-packages (from notebook->jupyter->sql_magic) (4.7.0)
Requirement already satisfied, skipping upgrade: Send2Trash in /usr/local/lib/python3.6/dist-packages (from notebook->jupyter->sql_magic) (1.5.0)
Requirement already satisfied, skipping upgrade: terminado>=0.8.1 in /usr/local/lib/python3.6/dist-packages (from notebook->jupyter->sql_magic) (0.9.2)
Requirement already satisfied, skipping upgrade: jinja2 in /usr/local/lib/python3.6/dist-packages (from notebook->jupyter->sql_magic) (2.11.2)
Requirement already satisfied, skipping upgrade: qtpy in /usr/local/lib/python3.6/dist-packages (from qtconsole->jupyter->sql_magic) (1.9.0)
Requirement already satisfied, skipping upgrade: pyzmq>=17.1 in /usr/local/lib/python3.6/dist-packages (from qtconsole->jupyter->sql_magic) (21.0.2)
Requirement already satisfied, skipping upgrade: entrypoints>=0.2.2 in /usr/local/lib/python3.6/dist-packages (from nbconvert->jupyter->sql_magic) (0.3)
Requirement already satisfied, skipping upgrade: defusedxml in /usr/local/lib/python3.6/dist-packages (from nbconvert->jupyter->sql_magic) (0.6.0)
Requirement already satisfied, skipping upgrade: bleach in /usr/local/lib/python3.6/dist-packages (from nbconvert->jupyter->sql_magic) (3.2.3)
Requirement already satisfied, skipping upgrade: testpath in /usr/local/lib/python3.6/dist-packages (from nbconvert->jupyter->sql_magic) (0.4.4)
Requirement already satisfied, skipping upgrade: pandocfilters>=1.4.1 in /usr/local/lib/python3.6/dist-packages (from nbconvert->jupyter->sql_magic) (1.4.3)
Requirement already satisfied, skipping upgrade: mistune<2,>=0.8.1 in /usr/local/lib/python3.6/dist-packages (from nbconvert->jupyter->sql_magic) (0.8.4)
Requirement already satisfied, skipping upgrade: wcwidth in /usr/local/lib/python3.6/dist-packages (from prompt-toolkit<2.0.0,>=1.0.4->ipython->sql_magic) (0.2.5)
Requirement already satisfied, skipping upgrade: ptyprocess>=0.5 in /usr/local/lib/python3.6/dist-packages (from pexpect; sys_platform != "win32"->ipython->sql_magic) (0.7.0)
Requirement already satisfied, skipping upgrade: jsonschema!=2.5.0,>=2.4 in /usr/local/lib/python3.6/dist-packages (from nbformat>=4.2.0->ipywidgets->jupyter->sql_magic) (2.6.0)
Requirement already satisfied, skipping upgrade: MarkupSafe>=0.23 in /usr/local/lib/python3.6/dist-packages (from jinja2->notebook->jupyter->sql_magic) (1.1.1)
Requirement already satisfied, skipping upgrade: webencodings in /usr/local/lib/python3.6/dist-packages (from bleach->nbconvert->jupyter->sql_magic) (0.5.1)
Requirement already satisfied, skipping upgrade: packaging in /usr/local/lib/python3.6/dist-packages (from bleach->nbconvert->jupyter->sql_magic) (20.8)
Requirement already satisfied, skipping upgrade: pyparsing>=2.0.2 in /usr/local/lib/python3.6/dist-packages (from packaging->bleach->nbconvert->jupyter->sql_magic) (2.4.7)

In [21]:
from sqlalchemy import create_engine

In [22]:
conn_string = 'mysql://{user}:{password}@{host}/?charset=utf8'.format(
    host = 'db.ipeirotis.org', 
    user = 'student',
    password = 'dwdstudent2015',
    encoding = 'utf-8')
engine = create_engine(conn_string)

In [23]:
%reload_ext sql_magic

/usr/local/lib/python3.6/dist-packages/psycopg2/__init__.py:144: UserWarning: The psycopg2 wheel package will be renamed from release 2.8; in order to keep installing from binary please use "pip install psycopg2-binary" instead. For details see: <http://initd.org/psycopg/docs/install.html#binary-install-from-pypi>.
  """)

In [24]:
%config SQL.conn_name = 'engine'

In [25]:
%%read_sql
show databases

Query started at 11:14:33 PM UTC; Query executed in 0.04 m

             Database
0  information_schema
1        bike_sharing
2            citibike
3   citibike_fall2017
4            facebook
5                imdb
6               music
7     nypd_complaints
8              public
9         restaurants

In [26]:
%%read_sql
use imdb

Query started at 11:14:36 PM UTC; Query executed in 0.01 m

In [27]:
%%read_sql
show tables

Query started at 11:14:37 PM UTC; Query executed in 0.01 m

     Tables_in_imdb
0            actors
1         directors
2  directors_genres
3            movies
4  movies_directors
5     movies_genres
6             roles

In [28]:
%%read_sql
describe actors

Query started at 11:14:40 PM UTC; Query executed in 0.01 m

        Field          Type Null  Key Default Extra
0          id       int(11)   NO  PRI       0
1  first_name  varchar(100)  YES  MUL    None
2   last_name  varchar(100)  YES  MUL    None
3      gender       char(1)  YES         None

In [29]:
%%read_sql
describe roles

Query started at 11:14:42 PM UTC; Query executed in 0.01 m

      Field          Type Null  Key Default Extra
0  actor_id       int(11)  YES  MUL    None
1  movie_id       int(11)  YES  MUL    None
2      role  varchar(100)  YES  MUL    None

### SELECT Queries (IMDB database)

In [30]:
%%read_sql
USE imdb

Query started at 11:14:51 PM UTC; Query executed in 0.01 m

#### Find all movie titles with id less than 100.

In [31]:
%%read_sql
SELECT * 
FROM movies 
WHERE id<100

Query started at 11:14:56 PM UTC; Query executed in 0.01 m

    id                                               name  year  rank
0    0                                                #28  2002   NaN
1    1                #7 Train: An Immigrant Journey, The  2000   NaN
2    2                                                  $  1971   6.4
3    3                                      $1,000 Reward  1913   NaN
4    4                                      $1,000 Reward  1915   NaN
..  ..                                                ...   ...   ...
91  95                            'Cross the Mexican Line  1914   NaN
92  96                 'Den vide verden's billedbog nr. 1  1938   NaN
93  97  'Deutschland' Leaving New York at Full Speed (...  1902   NaN
94  98                             'Diamond S' Ranch, The  1912   NaN
95  99             'Dikke Bertha' op doortocht in Brussel  1919   NaN

[96 rows x 4 columns]

#### Find all information about movies that were released before 1895 (excl)

In [32]:
%%read_sql
SELECT *
FROM movies 
WHERE year<1895

Query started at 11:15:03 PM UTC; Query executed in 0.01 m

        id                        name  year  rank
0    13261      Amateur Gymnast, No. 2  1894   NaN
1    17623   Annabelle Butterfly Dance  1894   5.3
2    17627  Annabelle Serpentine Dance  1894   6.1
3    17628         Annabelle Sun Dance  1894   NaN
4    17770                Annie Oakley  1894   4.9
..     ...                         ...   ...   ...
76  363640      Whirlwind Gun Spinning  1894   NaN
77  364791                 Widder, The  1894   NaN
78  368839                   Wrestling  1892   2.0
79  368852          Wrestling Dog, The  1894   NaN
80  368854             Wrestling Match  1894   NaN

[81 rows x 4 columns]

#### Find all information about movies that were released before 1895 and after 2006 (inclusive)

In [33]:
%%read_sql
SELECT *
FROM movies 
WHERE year<=1895 OR year>=2006

Query started at 11:15:08 PM UTC; Query executed in 0.01 m

         id                                      name  year  rank
0       899                               10th & Wolf  2006   NaN
1      1799                                      2176  2006   NaN
2      2238                                       300  2006   NaN
3      9086                                   Airborn  2006   NaN
4      9495                   Akrobatisches Potpourri  1895   5.2
..      ...                                       ...   ...   ...
351  369459                                   X-Men 3  2006   NaN
352  372568  Young Griffo v. Battling Charles Barnett  1895   NaN
353  374889                                   Zhmurki  2006   NaN
354  400649                        "Pacific War, The"  2006   NaN
355  409052     "Turin 2006: XX Olympic Winter Games"  2006   NaN

[356 rows x 4 columns]

#### Find all information about movies released between 1895 and 1898 (excl)

In [34]:
%%read_sql
SELECT *
FROM movies 
WHERE year>1895 AND year<1898

Query started at 11:15:13 PM UTC; Query executed in 0.01 m

          id                                               name  year  rank
0         56                                  'Amphitrite', The  1897   NaN
1         70                                      'Brennus', Le  1897   NaN
2        247                     'Standard' Picture Animated, A  1897   NaN
3       1076  13th Infantry, U.S. Army Marching Through Sall...  1897   NaN
4       1077  13th Infantry, U.S. Army, in Heavy Marching Or...  1897   NaN
...      ...                                                ...   ...   ...
1093  372727                                  Young Rivals, The  1897   NaN
1094  375815                              Zoo van Antwerpen, De  1897   NaN
1095  376589             Z Pereira na Romaria de Santo Tirso, O  1896   NaN
1096  377666                               cole des gendres, L'  1897   NaN
1097  377845                                  pisodes de guerre  1897   NaN

[1098 rows x 4 columns]

#### Find all information about *actresses* who are have first name Skyler

In [35]:
%%read_sql
SELECT *
FROM actors
WHERE first_name = 'Skyler' AND gender = 'F';

Query started at 11:15:19 PM UTC; Query executed in 0.01 m

       id first_name    last_name gender
0  556133     Skyler  Blankenship      F
1  570689     Skyler     Campbell      F
2  595403     Skyler          Day      F
3  773680     Skyler         Rose      F
4  776752     Skyler      Russell      F
5  789243     Skyler        Shaye      F

In [36]:
%%read_sql
select director_id,count(*) as number_of_movies from movies_directors group by director_id having number_of_movies >100;

Query started at 11:15:21 PM UTC; Query executed in 0.01 m

     director_id  number_of_movies
0           1958               360
1           2624               111
2           2643               135
3           3507               142
4           3822               108
..           ...               ...
183        85858               119
184        85886               141
185        86170               173
186        86511               101
187        87330               101

[188 rows x 2 columns]

#### Find the director ID of Steven Spielberg

In [37]:
%%read_sql
SELECT id
FROM directors
WHERE first_name = 'Steven' AND last_name = 'Spielberg';

Query started at 11:15:24 PM UTC; Query executed in 0.01 m

      id
0  75380

#### Find the director IDs and the first and last names of directors with the last name Spielberg and Hitchcock

In [38]:
%%read_sql
SELECT id, first_name, last_name
FROM directors
WHERE last_name = 'Spielberg' OR last_name = 'Hitchcock';

Query started at 11:15:28 PM UTC; Query executed in 0.01 m

      id       first_name  last_name
0  34658       Alfred (I)  Hitchcock
1  34659        Bill (II)  Hitchcock
2  34660  Charles Webster  Hitchcock
3  34661            Peter  Hitchcock
4  34662         Victress  Hitchcock
5  75380           Steven  Spielberg

#### Find all genres of films and the corresponding probabilities for the director ID that corresponds to Steven Spielberg. Sort the results by probability.

In [39]:
%%read_sql
SELECT genre, prob
FROM directors_genres
WHERE director_id = '75380' # the id of Spielberg FROM above
ORDER BY prob DESC

Query started at 11:15:31 PM UTC; Query executed in 0.01 m

          genre      prob
0         Drama  0.435897
1      Thriller  0.282051
2     Adventure  0.282051
3        Sci-Fi  0.256410
4        Action  0.230769
5        Horror  0.179487
6         Short  0.128205
7       Fantasy  0.102564
8           War  0.102564
9         Crime  0.102564
10       Comedy  0.076923
11       Family  0.076923
12      Mystery  0.051282
13      Romance  0.051282
14      Western  0.025641
15  Documentary  0.025641

#### Find the id of the movie Schindler's List.

In [40]:
%%read_sql
SELECT *
FROM movies
WHERE name = "Schindler's List"

Query started at 11:15:34 PM UTC; Query executed in 0.01 m

       id              name  year  rank
0  290070  Schindler's List  1993   8.8

#### List all the roles for the movie with id 290070. Sort them alphabetically

In [41]:
%%read_sql
SELECT *
FROM roles
WHERE movie_id = '290070'

Query started at 11:15:38 PM UTC; Query executed in 0.01 m

     actor_id  movie_id                          role
0       14688    290070               Auschwitz guard
1       18959    290070  Klaus Tauber (Gestapo clerk)
2       19022    290070              Julius Madritsch
3       21072    290070                   Chaim Nowak
4       31611    290070     Himself/Schindler mourner
..        ...       ...                           ...
141    806842    290070                  Ghetto woman
142    828128    290070                Brinnlitz girl
143    839849    290070               Clara Sternberg
144    841110    290070           Plaszow Jewish girl
145    842416    290070                  Ghetto woman

[146 rows x 3 columns]

### SELECT Queries (Facebook database)

In [42]:
%%read_sql
USE facebook

Query started at 11:15:41 PM UTC; Query executed in 0.01 m

#### Find all names of students FROM the Profiles table

In [43]:
%%read_sql
SELECT name
FROM Profiles

Query started at 11:15:44 PM UTC; Query executed in 0.01 m

                name
0        The Creator
1      Brian Whitton
2      Anita Nagwani
3          Sunny Kim
4       Ariel Podwal
...              ...
25779     Jen Slovin
25780  Kumi Dikengil
25781      Sky Gaven
25782      Eli Brown
25783     Tunga Mbia

[25784 rows x 1 columns]

#### Get the names and sex of all liberal students

In [44]:
%%read_sql
SELECT name, sex
FROM Profiles
WHERE PoliticalViews ='Liberal'

Query started at 11:15:47 PM UTC; Query executed in 0.01 m

                    name     sex
0          Stephanie Lai  Female
1              Josh Fern    Male
2           Blaine Davis    Male
3           Sacha Kenton  Female
4            Kelly Quann  Female
...                  ...     ...
6456  Maggie Winterfeldt    None
6457         Sonia Avila    None
6458         Kat Redniss  Female
6459          Haby Barry  Female
6460      Tu-Lien Nguyen  Female

[6461 rows x 2 columns]

#### Get the High Schools of the students in the database

In [45]:
%%read_sql
SELECT HighSchool
FROM Profiles

Query started at 11:15:50 PM UTC; Query executed in 0.01 m

                                          HighSchool
0                                               None
1                       George W.Hewlett High School
2               Ward Melville Senior High School '02
3      West Windsor Plainsboro High School South '03
4                           Harrison High School '03
...                                              ...
25779                          Worcester Academy '04
25780                                           None
25781                                           None
25782                                           None
25783                                           None

[25784 rows x 1 columns]

#### Find all the possible political views, eliminating duplicate entries

In [46]:
%%read_sql
SELECT DISTINCT PoliticalViews
FROM Profiles

Query started at 11:15:54 PM UTC; Query executed in 0.01 m

      PoliticalViews
0               None
1        Libertarian
2       Conservative
3            Liberal
4          Apathetic
5           Moderate
6       Very Liberal
7  Very Conservative
8              Other

#### Find all possible relationship statuses

In [47]:
%%read_sql
SELECT DISTINCT Status
FROM Relationship

Query started at 11:15:57 PM UTC; Query executed in 0.01 m

                    Status
0                   Single
1        In a Relationship
2                  Married
3  In an Open Relationship
4         It's complicated
5                  Engaged

#### Find all possible values for the “status” attribute in Profiles

In [48]:
%%read_sql
SELECT DISTINCT Status
FROM Profiles

Query started at 11:16:00 PM UTC; Query executed in 0.01 m

           Status
0       Undergrad
1  Alumnus/Alumna
2         Faculty
3    Grad Student
4            None
5           Staff
6  Summer Student

#### Find all possible values for the “Residence” attribute in Profiles, eliminating duplicates

In [49]:
%%read_sql
SELECT DISTINCT Residence
FROM Profiles

Query started at 11:16:04 PM UTC; Query executed in 0.01 m

                   Residence
0                       None
1      Thirteenth Street 5AN
2             Palladium 524D
3             Carlyle Court
4             Palladium 524F
...                      ...
5084        Cliff Street 17F
5085  Lafayette Street 1203B
5086      Weinstein Hall 423
5087      Broome Street 706A
5088  Lafayette Street 1502A

[5089 rows x 1 columns]

#### Find all students living in Palladium

In [50]:
%%read_sql
SELECT Name, Residence
FROM Profiles
WHERE Residence LIKE 'Palladium%%'

Query started at 11:16:08 PM UTC; Query executed in 0.01 m

                 Name       Residence
0        Ariel Podwal  Palladium 524D
1           Josh Fern  Palladium 524F
2     Santosh Sateesh   Palladium 603
3      Holly Hamilton      Palladium
4    Yuriy Prilutskiy  Palladium 1114
..                ...             ...
776     David Laubach      Palladium
777     Michael Chang  Palladium 2302
778       Hiro Fukuda      Palladium
779   Elizabeth Demas  Palladium 827B
780      Nicole Rosen      Palladium

[781 rows x 2 columns]

#### Find all students who attended Stuyvesant

In [51]:
%%read_sql
SELECT *
FROM Profiles
WHERE HighSchool LIKE 'Stuyvesant%%'

Query started at 11:16:12 PM UTC; Query executed in 0.01 m

     ProfileID           Name  ...         CurrentTown CurrentState
0       800073     Jueyu Wang  ...                None         None
1       800077    Sean Brandt  ...                None         None
2       800083     George Liu  ...                None         None
3       800092        Hong Li  ...                None         None
4       800356     Peter Naas  ...                None         None
..         ...            ...  ...                 ...          ...
232     831501     Eliza Chan  ...  Brooklyn, NY 11229         None
233     831928  Jeff Strabone  ...       Brooklyn, NY          None
234     832061    Annie Chang  ...                None         None
235     832913     Elijah Kim  ...                None         None
236     833781       Mike Sim  ...                None         None

[237 rows x 19 columns]

#### Find all names that contain a digit

In [52]:
%%read_sql
SELECT * 
FROM Profiles 
WHERE name REGEXP '[0-9]+'

Query started at 11:16:16 PM UTC; Query executed in 0.01 m

   ProfileID                     Name  ...    CurrentTown CurrentState
0     817012               Tbone 3000  ...           None         None
1     817574                      K 5  ...           None           NY
2     818366               Arielle 4u  ...           None         None
3     819379                    ML152  ...        NY, NY          None
4     819606              Panaflex 16  ...           None         None
5     821186  g nupe the hazel eyed 1  ...           None         None
6     823755           NYC Summer2005  ...  NYC, NY 10012         None
7     827978               Ben 0viatt  ...           None         None

[8 rows x 19 columns]

#### Find all students with a name that contains a non-letter character, other than \- and \.

In [53]:
%%read_sql
SELECT * 
FROM Profiles 
WHERE name NOT REGEXP '^[A-z \-\.]+$'

Query started at 11:16:23 PM UTC; Query executed in 0.01 m

    ProfileID  ... CurrentState
0      800794  ...         None
1      802953  ...         None
2      803148  ...         None
3      803169  ...         None
4      803349  ...         None
5      803696  ...         None
6      804467  ...         None
7      805463  ...         None
8      806663  ...         None
9      807220  ...         None
10     808815  ...         None
11     809153  ...         None
12     809359  ...         None
13     810447  ...         None
14     810711  ...         None
15     810796  ...         None
16     812249  ...         None
17     812902  ...         None
18     813147  ...         None
19     814475  ...         None
20     816365  ...         None
21     816689  ...         None
22     817012  ...         None
23     817118  ...         None
24     817574  ...           NY
25     818366  ...         None
26     818825  ...         None
27     818829  ...         None
28     818841  ...         None
29     819305  ...         None
30     819379  ...         None
31     819606  ...         None
32     819681  ...         None
33     819973  ...         None
34     820434  ...         None
35     820682  ...         None
36     820721  ...         None
37     821176  ...         None
38     821186  ...         None
39     822269  ...         None
40     823029  ...         None
41     823455  ...         None
42     823755  ...         None
43     824519  ...         None
44     826997  ...         None
45     827298  ...         None
46     827776  ...         None
47     827978  ...         None
48     829942  ...         None
49     830030  ...         None

[50 rows x 19 columns]

### Aggregation Queries (IMDB Database)

In [54]:
%%read_sql
USE imdb;

Query started at 11:16:26 PM UTC; Query executed in 0.01 m

#### Number of movies for each director

In [55]:
%%read_sql
SELECT director_id, count(*) AS NumberOfMovies
FROM movies_directors 
GROUP BY director_id
LIMIT 100;

Query started at 11:16:31 PM UTC; Query executed in 0.01 m

    director_id  NumberOfMovies
0             1               1
1             2               1
2             3               2
3             4               1
4             5               1
..          ...             ...
95           96               1
96           97               5
97           98               2
98           99               4
99          100               2

[100 rows x 2 columns]

#### Rank directors by the number of movies they directed

In [56]:
%%read_sql
SELECT director_id, count(*) AS NumberOfMovies
FROM movies_directors 
GROUP BY director_id
ORDER BY count(*) desc

Query started at 11:16:35 PM UTC; Query executed in 0.01 m

       director_id  NumberOfMovies
0            25116             619
1            56530             562
2            30570             536
3             9277             370
4             1958             360
...            ...             ...
88599         4105               1
88600        62346               1
88601        80050               1
88602        84160               1
88603        68245               1

[88604 rows x 2 columns]

#### Find the number of actors in each movie

In [57]:
%%read_sql
SELECT movie_id, count(*) 
FROM roles 
GROUP BY movie_id

Query started at 11:16:41 PM UTC; Query executed in 0.04 m

        movie_id  count(*)
0              0         2
1              2        20
2              3         4
3              4         4
4              5         1
...          ...       ...
300247    412315         1
300248    412316        15
300249    412317        11
300250    412318         9
300251    412319        13

[300252 rows x 2 columns]

#### Find the movies with more than 100 actors

In [58]:
%%read_sql
SELECT movie_id, count(*) 
FROM roles 
GROUP BY movie_id
HAVING count(*) > 100;

Query started at 11:16:49 PM UTC; Query executed in 0.03 m

     movie_id  count(*)
0         687       153
1         846       174
2        1674       164
3        1703       114
4        2250       112
..        ...       ...
544    411545       188
545    411546       205
546    411585       108
547    411802       533
548    411809       129

[549 rows x 2 columns]

#### Find the most popular genres (basd on the number of movies)

In [59]:
%%read_sql
SELECT genre, count(*) 
FROM movies_genres
GROUP BY genre
ORDER BY count(*) desc

Query started at 11:16:55 PM UTC; Query executed in 0.02 m

          genre  count(*)
0         Short     82597
1         Drama     74615
2        Comedy     57860
3   Documentary     42320
4         Adult     20667
5     Animation     17888
6        Action     14885
7       Romance     13873
8         Crime     12966
9        Family     11232
10     Thriller     10953
11    Adventure      8992
12      Western      8539
13       Horror      7520
14      Musical      7055
15        Music      5664
16      Fantasy      5223
17       Sci-Fi      5111
18      Mystery      4971
19          War      4436
20    Film-Noir       417

#### Find the average rank of the movies in the database, per year of release

In [60]:
%%read_sql
SELECT year, avg(rank) 
FROM movies
GROUP BY year

Query started at 11:17:01 PM UTC; Query executed in 0.01 m

     year  avg(rank)
0    1888        NaN
1    1890   7.300000
2    1891   3.683333
3    1892   2.866667
4    1893   6.800000
..    ...        ...
115  2004   6.217399
116  2005        NaN
117  2006        NaN
118  2007        NaN
119  2008        NaN

[120 rows x 2 columns]

### Aggregation Queries (Facebook database)

In [61]:
%%read_sql
USE facebook

Query started at 11:17:07 PM UTC; Query executed in 0.01 m

#### List the number of males and females

In [62]:
%%read_sql
SELECT sex, count(*) 
FROM Profiles 
GROUP BY sex

Query started at 11:17:13 PM UTC; Query executed in 0.01 m

      sex  count(*)
0    None      4498
1  Female     12311
2    Male      8975

#### List the number of students for each political view

In [63]:
%%read_sql
SELECT PoliticalViews, count(*) 
FROM Profiles 
GROUP BY PoliticalViews

Query started at 11:17:19 PM UTC; Query executed in 0.01 m

      PoliticalViews  count(*)
0               None     11091
1          Apathetic       805
2       Conservative       936
3            Liberal      6461
4        Libertarian       325
5           Moderate      2898
6              Other       824
7  Very Conservative       167
8       Very Liberal      2277

#### List the number of males and female students for each political view

In [64]:
%%read_sql
SELECT Sex, PoliticalViews, count(*) 
FROM Profiles 
WHERE Sex is not null and PoliticalViews is not null
GROUP BY Sex, PoliticalViews

Query started at 11:17:23 PM UTC; Query executed in 0.01 m

       Sex     PoliticalViews  count(*)
0   Female          Apathetic       309
1   Female       Conservative       428
2   Female            Liberal      4054
3   Female        Libertarian       113
4   Female           Moderate      1444
5   Female              Other       280
6   Female  Very Conservative        38
7   Female       Very Liberal      1362
8     Male          Apathetic       462
9     Male       Conservative       474
10    Male            Liberal      2196
11    Male        Libertarian       196
12    Male           Moderate      1379
13    Male              Other       482
14    Male  Very Conservative       107
15    Male       Very Liberal       813

#### List the number of students per each birth year: Use the Year(date) function to get the year value FROM a dateime column List only years that have at least 10 students

In [65]:
%%read_sql
SELECT YEAR(birthday), count(*) 
FROM Profiles 
WHERE birthday is not null
GROUP BY YEAR(birthday)
HAVING count(*) > 10

Query started at 11:17:34 PM UTC; Query executed in 0.01 m

    YEAR(birthday)  count(*)
0             1905        34
1             1974        29
2             1975        28
3             1976        35
4             1977        61
5             1978        90
6             1979       159
7             1980       309
8             1981       585
9             1982      1387
10            1983      2601
11            1984      2985
12            1985      3525
13            1986      3735
14            1987      2870
15            1988        57

#### Find the most popular tv shows and books

In [66]:
%%read_sql
SELECT TVShow, count(*) 
FROM FavoriteTVShows 
WHERE TVShow is not null 
GROUP BY TVShow
ORDER BY count(*) desc

Query started at 11:17:40 PM UTC; Query executed in 0.01 m

                                            TVShow  count(*)
0                                       Family Guy      1146
1                                 Sex And The City       649
2                                             Lost       640
3                             Arrested Development       610
4                                   Grey s Anatomy       575
...                                            ...       ...
6482                                Weeds Showtime         1
6483                                 Made No Shame         1
6484  But Southpark And Family Guy When They re On         1
6485                 And Family Guy And Hey Arnold         1
6486                            24 I Love You Jack         1

[6487 rows x 2 columns]

In [67]:
%%read_sql
SELECT Book, count(*) 
FROM FavoriteBooks
WHERE Book is not null 
GROUP BY Book
ORDER BY count(*) desc

Query started at 11:17:42 PM UTC; Query executed in 0.02 m

                                                    Book  count(*)
0                                           Harry Potter      1320
1                                     Catcher In The Rye      1079
2                                       The Great Gatsby       963
3                                                   1984       725
4                                    Pride And Prejudice       602
...                                                  ...       ...
28665     Fantasy Stuff Like Narnia And Madeline L Engle         1
28666  Fantasy Stuff Sword Of Truth And Exotic Car Ma...         1
28667                                           Far Away         1
28668                       Far From The Maddening Croud         1
28669                   Far From The Madding Crowd Hardy         1

[28670 rows x 2 columns]

#### Find the number of students in various relationship statuses

In [68]:
%%read_sql
SELECT Status, count(*) 
FROM Relationship
GROUP BY Status

Query started at 11:17:47 PM UTC; Query executed in 0.01 m

                    Status  count(*)
0                  Engaged         1
1        In a Relationship      4851
2  In an Open Relationship       565
3         It's complicated        17
4                  Married      2337
5                   Single      7872

#### Find the most popular majors (concentrations)

In [69]:
%%read_sql
SELECT Concentration,count(*) FROM Concentration
WHERE Concentration is not null
GROUP BY Concentration
ORDER BY count(*) desc;

Query started at 11:17:52 PM UTC; Query executed in 0.01 m

                                         Concentration  count(*)
0                                              Finance      1810
1                                           Psychology      1571
2                                            Economics      1533
3                    Journalism and Mass Communication      1267
4                                             Politics      1196
..                                                 ...       ...
134  Education (minor only; through School of Educa...         1
135                                     Slavic Studies         1
136                German and Linguistics (major only)         1
137                       Ancient Studies (minor only)         1
138                         Irish Studies (minor only)         1

[139 rows x 2 columns]

### JOINS

In [70]:
%%read_sql
USE imdb

Query started at 11:17:55 PM UTC; Query executed in 0.01 m

In [71]:
%%read_sql
# List all the movies from year 2000
SELECT *
FROM movies M
WHERE M.year = 2000;

Query started at 11:17:57 PM UTC; Query executed in 0.01 m

           id                                               name  year  rank
0           1                #7 Train: An Immigrant Journey, The  2000   NaN
1          31                                              $pent  2000   4.3
2          34                                            & frres  2000   NaN
3          46      '70s: The Decade That Changed Television, The  2000   NaN
4         176  'N Sync & Britney Spears: Your #1 Video Reques...  2000   NaN
...       ...                                                ...   ...   ...
11638  412155                                 "Quin dijo miedo?"  2000   NaN
11639  412218                                     "ndernes magt"  2000   NaN
11640  412221                                         "pent hus"  2000   NaN
11641  412232                           "a s'en va et a revient"  2000   NaN
11642  412267                                     "v Hangja, Az"  2000   NaN

[11643 rows x 4 columns]

#### List all the movies from year 2000 and their genres

In [72]:
%%read_sql
SELECT *
FROM movies M INNER JOIN movies_genres MG ON M.id=MG.movie_id
WHERE M.year = 2000;

Query started at 11:18:04 PM UTC; Query executed in 0.01 m

           id  ...        genre
0           1  ...        Short
1           1  ...  Documentary
2          31  ...        Drama
3          34  ...        Short
4          46  ...  Documentary
...       ...  ...          ...
12138  378537  ...        Short
12139  378550  ...       Comedy
12140  378550  ...        Crime
12141  378550  ...        Drama
12142  378557  ...  Documentary

[12143 rows x 6 columns]

#### List all the Drama movies from year 2000

In [73]:
%%read_sql

SELECT *
FROM movies M INNER JOIN movies_genres MG ON M.id=MG.movie_id
WHERE M.year = 2000 AND MG.genre = 'Drama';

Query started at 11:18:14 PM UTC; Query executed in 0.01 m

          id  ...  genre
0         31  ...  Drama
1        428  ...  Drama
2        598  ...  Drama
3        992  ...  Drama
4       1023  ...  Drama
...      ...  ...    ...
1864  377490  ...  Drama
1865  378026  ...  Drama
1866  378121  ...  Drama
1867  378308  ...  Drama
1868  378550  ...  Drama

[1869 rows x 6 columns]

#### List all the movies from year 2000 and their average rating broken down by genre

In [74]:
%%read_sql
SELECT AVG(M.rank), MG.genre
FROM movies M INNER JOIN movies_genres MG ON M.id=MG.movie_id
WHERE M.year = 2000
GROUP BY MG.genre;

Query started at 11:18:25 PM UTC; Query executed in 0.01 m

    AVG(M.rank)        genre
0      5.454639       Action
1           NaN        Adult
2      5.782759    Adventure
3      6.505882    Animation
4      5.899568       Comedy
5      5.908228        Crime
6      6.913761  Documentary
7      6.087035        Drama
8      5.787879       Family
9      5.938158      Fantasy
10     4.973913       Horror
11     6.512500        Music
12     6.070732      Musical
13     5.956897      Mystery
14     6.199571      Romance
15     5.398592       Sci-Fi
16     6.560808        Short
17     5.281185     Thriller
18     6.440741          War
19     5.290909      Western

In [75]:
%%read_sql
# List the average ratings for the movies broken down by genre
SELECT AVG(M.rank) AS avg_rating, MG.genre
FROM movies M INNER JOIN movies_genres MG ON M.id=MG.movie_id
GROUP BY MG.genre
ORDER BY avg_rating DESC

Query started at 11:18:33 PM UTC; Query executed in 0.02 m

    avg_rating        genre
0     6.701768    Film-Noir
1     6.557896    Animation
2     6.496829  Documentary
3     6.428049        Adult
4     6.415912        Music
5     6.394257        Short
6     6.377797          War
7     6.315130       Family
8     6.156967      Romance
9     6.137848        Drama
10    6.087347      Musical
11    5.932294      Mystery
12    5.905311       Comedy
13    5.860042        Crime
14    5.848193      Fantasy
15    5.651213      Western
16    5.581717    Adventure
17    5.527481     Thriller
18    5.339820       Action
19    5.010579       Sci-Fi
20    4.756930       Horror

In [76]:
%%read_sql
SELECT distinct a.first_name, a.last_name 
FROM actors a INNER JOIN roles r ON a.id = r.actor_id
    INNER JOIN movies_directors md ON r.movie_id = md.movie_id
    INNER JOIN directors d ON d.id = md.director_id
WHERE d.first_name = 'Steven' and d.last_name='Spielberg';

Query started at 11:18:37 PM UTC; Query executed in 0.01 m

      first_name last_name
0            Dan   Aykroyd
1     E. Hampton    Beagle
2            Ned    Beatty
3           John   Belushi
4         Jordan     Brian
...          ...       ...
1635       David      Soul
1636        Joan   Darling
1637   Christine  Matchett
1638      Luther     Adler
1639         Roy   Thinnes

[1640 rows x 2 columns]

#### List all the actors that worked with Steven Spielberg

#### Compute the average rank for the movies direcred by steven spielberg

In [77]:
%%read_sql
SELECT avg(rank) 
FROM movies m 
    INNER JOIN movies_directors md ON m.id = md.movie_id
    INNER JOIN directors d ON d.id = md.director_id
WHERE d.first_name = 'Steven' and d.last_name='Spielberg';

Query started at 11:18:39 PM UTC; Query executed in 0.01 m

   avg(rank)
0   7.546429

#### List the movies of Brad Pitt - exclude those that he plays himself

In [78]:
%%read_sql
SELECT m.name 
FROM movies m 
    INNER JOIN roles r on m.id = r.movie_id 
    INNER JOIN actors a on r.actor_id = a.id
WHERE r.role not like '%%Himself%%' and a.first_name = 'Brad' and a.last_name = 'Pitt'

Query started at 11:18:41 PM UTC; Query executed in 0.01 m

                                                 name
0                                   Across the Tracks
1                     Confessions of a Dangerous Mind
2                                             Contact
3                                          Cool World
4                           Dark Side of the Sun, The
5                                    Devil's Own, The
6                                          Favor, The
7                                          Fight Club
8                                  Growing Up Grizzly
9                             Happy Together (1989/I)
10                                         Image, The
11  Interview with the Vampire: The Vampire Chroni...
12                                       Johnny Suede
13                                         Kalifornia
14                                Legends of the Fall
15                                     Less Than Zero
16                                     Meet Joe Black
17                                       Mexican, The
18                                 Mr. and Mrs. Smith
19                                      No Man's Land
20                                     Ocean's Eleven
21                                     Ocean's Twelve
22                           River Runs Through It, A
23                                              Se7en
24                               Seven Years in Tibet
25                   Sinbad: Legend of the Seven Seas
26                                           Sleepers
27                                            Snatch.
28                                           Spy Game
29                        Stoning in Fulham County, A
30                                    Thelma & Louise
31                                  Too Young to Die?
32                                               Troy
33                                       True Romance
34                                     Twelve Monkeys
35                                   Two-Fisted Tales
36                    Ultimate Fights from the Movies
37                                    "Another World"
38                                       "Glory Days"

#### Average rank of Brad Pitt's movies

In [79]:
%%read_sql
SELECT avg(rank) 
FROM movies m 
    INNER JOIN roles r on m.id = r.movie_id 
    INNER JOIN actors a on r.actor_id = a.id
WHERE r.role not like '%%Himself%%' and a.first_name = 'Brad' and a.last_name = 'Pitt'

Query started at 11:18:43 PM UTC; Query executed in 0.01 m

   avg(rank)
0    6.52069

#### List the genre of the movies where Sean Connery appears, and rank them in descending order by count

In [80]:
%%read_sql
SELECT mg.genre, count(*) 
FROM movies_genres mg 
    INNER JOIN movies m ON m.id =mg.movie_id
    INNER JOIN roles r ON m.id = r.movie_id 
    INNER JOIN actors a ON r.actor_id = a.id
WHERE r.role not like '%%Himself%%' and a.first_name = 'Sean' and a.last_name = 'Connery'
GROUP BY genre
ORDER BY count(*) desc

Query started at 11:18:45 PM UTC; Query executed in 0.01 m

          genre  count(*)
0         Drama        32
1        Action        28
2     Adventure        22
3      Thriller        21
4         Crime        15
5        Sci-Fi         8
6        Comedy         8
7       Romance         7
8       Fantasy         6
9       Mystery         6
10          War         4
11  Documentary         3
12        Short         2
13       Family         1
14      Western         1

#### Compute the average rank for the movies of each actor and rank the actors in descending order based on that rank. List only actors with at least 20 rated movies.

In [81]:
%%read_sql
SELECT a.*, avg(rank) as avg_rating, count(m.id) as num_movies, count(m.rank) as rated_movies
FROM movies m 
    INNER JOIN roles r on m.id = r.movie_id 
    INNER JOIN actors a ON a.id = r.actor_id
GROUP BY a.id
HAVING count(m.rank)>=20
ORDER BY avg(rank) desc

Query started at 11:18:47 PM UTC; Query executed in 0.46 m

          id first_name  last_name gender  avg_rating  num_movies  rated_movies
0     234674     Michel   Journiac      M    8.195000          21            20
1      40834        Ion     Besoiu      M    8.181250          79            32
2     391209      Colea      Rautu      M    8.161905          56            21
3     123218   Gheorghe     Dinica      M    8.135484          59            31
4     724198      Leela     Mishra      F    8.122727         130            22
...      ...        ...        ...    ...         ...         ...           ...
9500  225254   Jon (II)     Jacobs      M    3.290476          30            21
9501  727436    Melissa      Moore      F    3.286364          28            22
9502  606609    Griffin       Drew      F    3.247619          36            21
9503  497017       Lars  von Trier      M    3.172727          32            22
9504  644511  Gabriella       Hall      F    2.765000          38            20

[9505 rows x 7 columns]

### Subqueries

#### List all the actors that have not worked with Francis Ford Coppola.

In [82]:
%%read_sql 
SELECT * 
FROM actors 
WHERE id NOT IN (
    SELECT DISTINCT R.actor_id
    FROM roles R 
        INNER JOIN movies_directors MD ON R.movie_id=MD.movie_id
        INNER JOIN directors D ON MD.director_id=D.id 
    WHERE D.first_name = 'Francis Ford' and D.last_name = 'Coppola'
)

Query started at 11:19:14 PM UTC; Query executed in 0.04 m

            id     first_name           last_name gender
0            2        Michael  'babeepower' Viera      M
1            3           Eloy         'Chincheta'      M
2            4       Dieguito         'El Cigala'      M
3            5        Antonio    'El de Chipiona'      M
4            6           José        'El Francés'      M
...        ...            ...                 ...    ...
816728  845461         Herdís      Þorvaldsdóttir      F
816729  845462  Katla Margrét      Þorvaldsdóttir      F
816730  845463     Lilja Nótt      Þórarinsdóttir      F
816731  845464     Hólmfríður      Þórhallsdóttir      F
816732  845465       Theódóra        Þórðardóttir      F

[816733 rows x 4 columns]

#### Find the average number of movies directed by each director

In [83]:
%%read_sql
SELECT avg(noMovies)
FROM 
    (
    SELECT director_id, count(*) as noMovies 
    FROM movies_directors dm 
    GROUP BY director_id
    ) r;

Query started at 11:19:17 PM UTC; Query executed in 0.01 m

   avg(noMovies)
0         4.5931

#### Report how many directors have directed one movie, two movies, three movies, etc. (in other words, create a the distribution for the variable "number of movies directed by a given director")

In [84]:
%%read_sql
SELECT NumMovies, COUNT(director_id) as NumDirectors
FROM 
    (
    SELECT director_id, count(*) as NumMovies 
    FROM movies_directors dm 
    GROUP BY director_id
    ) r
GROUP BY NumMovies
ORDER BY NumMovies;

Query started at 11:19:18 PM UTC; Query executed in 0.01 m

     NumMovies  NumDirectors
0            1         47339
1            2         13678
2            3          6495
3            4          3982
4            5          2702
..         ...           ...
196        360             1
197        370             1
198        536             1
199        562             1
200        619             1

[201 rows x 2 columns]

#### Find the average number of movies played by each actor

In [85]:
%%read_sql
SELECT avg(noMovies) 
FROM
(
SELECT actor_id, count(distinct movie_id) as noMovies 
FROM roles 
GROUP BY actor_id
) r;

Query started at 11:19:18 PM UTC; Query executed in 0.22 m

   avg(noMovies)
0         4.1964

In [86]:
%%read_sql
SELECT NumMovies, COUNT(actor_id) as NumActors
FROM 
    (
    SELECT actor_id, count(*) as NumMovies 
    FROM roles r 
    GROUP BY actor_id
    ) r
GROUP BY NumMovies
ORDER BY NumMovies;

Query started at 11:19:32 PM UTC; Query executed in 0.03 m

     NumMovies  NumActors
0            1     508544
1            2     103966
2            3      47369
3            4      28173
4            5      19103
..         ...        ...
348        543          1
349        544          3
350        549          1
351        672          1
352        909          1

[353 rows x 2 columns]

#### Find the maximum number of genres associated with a movie

In [ ]:
%%read_sql
SELECT max(noGenres) FROM (
SELECT count(*) as noGenres
FROM movies_genres
GROUP BY movie_id) r;

In [ ]:
%%read_sql
SELECT max(noMovies)FROM (
SELECT count(*) as noMovies, director_id as director
FROM movies_directors
GROUP BY director_id
) r;

In [ ]:
%%read_sql
SELECT count(*) as noMovies, director_id as director
FROM movies_directors
GROUP BY director_id
;

#### Compare the favorite books of liberal and conservative students

In [87]:
%%read_sql

USE facebook;

SELECT BC.Book, 
    BC.C AS cons,
    BL.L AS libs,
    BC.C/C.NC AS perc_cons, 
    BL.L/L.NL AS perc_libs,
    (BC.C/C.NC)/(BL.L/L.NL) AS lift_cons,
    (BL.L/L.NL)/(BC.C/C.NC) AS lift_libs
FROM 
    (
    SELECT B.Book, COUNT(P.ProfileID) AS C
    FROM Profiles AS P 
        INNER JOIN FavoriteBooks AS B ON P.ProfileID = B.ProfileId
    WHERE PoliticalViews = 'Conservative'
    GROUP BY B.Book
    ) BC 
JOIN 
    (
    SELECT B.Book, COUNT(P.ProfileID) AS L
    FROM Profiles AS P 
        INNER JOIN FavoriteBooks AS B ON P.ProfileID = B.ProfileId
    WHERE PoliticalViews = 'Liberal'
    GROUP BY B.Book
    ) BL ON BC.Book = BL.Book 
JOIN
    (
    SELECT COUNT(*) AS NC 
    FROM Profiles 
    WHERE PoliticalViews = 'Conservative'
    ) C 
JOIN 
    (
    SELECT COUNT(*) AS NL
    FROM Profiles 
    WHERE PoliticalViews = 'Liberal'
    ) L
WHERE BC.C > 5 AND BL.L > 5
ORDER BY lift_cons DESC

Query started at 11:20:11 PM UTC; Query executed in 0.01 m

                  Book  cons  libs  perc_cons  perc_libs  lift_cons  lift_libs
0                Bible    10     7     0.0107     0.0011   9.861116   0.101408
1      Monkey Business     8     7     0.0085     0.0011   7.888893   0.126760
2            The Bible    21    25     0.0224     0.0039   5.798333   0.172463
3            Moneyball     9    15     0.0096     0.0023   4.141666   0.241449
4           The Prince    14    25     0.0150     0.0039   3.865555   0.258695
..                 ...   ...   ...        ...        ...        ...        ...
69       The Alchemist     7    91     0.0075     0.0141   0.530983   1.883300
70  Catcher In The Rye    32   452     0.0342     0.0700   0.488692   2.046278
71              Lolita    10   144     0.0107     0.0223   0.479360   2.086117
72    The Lovely Bones     6    93     0.0064     0.0144   0.445340   2.245473
73           The Giver     7   110     0.0075     0.0170   0.439268   2.276516

[74 rows x 7 columns]